Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: Give the user a chance to save and quit, to not save but quit anyway, or to cancel the exit command altogether.
ja: 保存して終了するか、保存せずに終了するか、終了コマンドを完全にキャンセルするかをユーザが選択できるようにしてください。

source: Global instance of a wxPoint initialized with values (-1,-1).
ja: (-1,-1) に初期化された wxPoint のグルーバルインスタンス。

source: Global instance of a wxSize object initialized to (-1,-1).
ja: (-1,-1) に初期化された wxSize のグルーバルインスタンス。

source: Globally enable or disable logging.
ja: ロギングをグローバルに有効化、または無効化します。

source: Glossary
ja: 用語集

source: Help Files
ja: ヘルプファイル

source: Help files
ja: ヘルプファイル

source: Hence, all wxString manipulation in your application will then operate on Unicode strings, and almost as easily as working with ordinary char strings (you just need to remember to use the wxT() macro to encapsulate any string literals).
ja: したがって、wxString に対するすべての操作は Unicode 文字列に対して行われます。これは普通の char 文字列を使用する場合とほぼ同じくらい簡単です。(wxT() マクロを使用してリテラル文字列を囲むことを覚えておく必要があるだけです)

source: Here are all of them:
ja: 以下にすべての関数を示します:

source: Here are some examples, using a wxString object s and some integer n:
ja: その例を以下に示します。この例では wxString オブジェクト s と、ある整数 n を使用しています:

source: Here is a sample:
ja: 以下に例を示します:

source: Here is an example of wxTextValidator usage.
ja: ここでは wxTextValidator の使い方の例を示します。

source: Here is an example, taken mostly from the wxPlot library, which is in the contrib section of the wxWidgets sources.
ja: wxPlot ライブラリから抜粋した例を以下に示します。このコードは wxWidgets のソースコードの contrib セクションにあります。

source: Here is an example:
ja: 例を以下に示します:

source: Here's an example of an event table.
ja: イベントテーブルの例を以下に示します。

source: Here's how you'd do the previous example with wxSizerFlags:
ja: wxSizerFlags を使用して上記の例と同じことをすると以下のようになります:

source: Here, MyConnection will respond to OnAdvise messages sent by the server by displaying a message box.
ja: ここでは MyConnection がサーバから送信された OnAdvise メッセージに反応してメッセージボックスを表示します。

source: Here, cMB2WC of the UTF8 object returns a wxWCharBuffer containing a Unicode string.
ja: ここで、UTF-8 オブジェクトの cMB2WC は Unicode 文字列を含む wxWCharBuffer を返却します。

source: Here, you can examine the events coming from buttons and windows, and if acceptable, pass them through to the original event handler.
ja: ここでは、ボタンやウィンドウから送られてくるイベントを検証し、それが適用可能なものである場合に元のイベントハンドラへ渡す、ということを行えます。

source: Hides or shows the dialog.
ja: ダイアログの表示・非表示を切り替えます。

source: Hiding Controls Using Sizers
ja: サイザーによるコントロールの非表示

source: Hiding controls using sizers
ja: サイザーによるコントロールの非表示

source: How Events Propagate Upwards
ja: 上位階層へのイベント伝播方法

source: How Events are Processed
ja: イベント処理の仕組み

source: How Validators Interact with Dialogs
ja: バリデータとダイアログ間のやり取り

source: How can the application close a window itself?
ja: どのようにしてアプリケーションからウィンドウを削除できますか?

source: How do I exit the application gracefully?
ja: アプリケーションを正しく終了するにはどうすれば良いですか?

source: How is this done?
ja: これはどのように行われるのでしょうか?

source: How validators interact with dialogs
ja: バリデータとダイアログ間のやり取り

source: However code such as
ja: しかし、以下のようなコードは

source: However different formats have specific advantages and disadvantages.
ja: しかし、各フォーマットにはそれぞれ利点と欠点があります。

source: However if the program never manipulates 8 bit strings internally, using char* pointers is safe as well.
ja: しかし、内部で絶対に 8 ビット文字列を操作しないというのであれば、char* ポインターを使用しても安全です。

source: However if you define a custom log target, messages may be logged out of order, e.g. messages from the main thread with later timestamp may appear before messages with earlier timestamp logged from other threads.
ja: しかし、カスタムログターゲットを定義している場合、メッセージの記録される順がバラバラになる可能性があります。例えば、より後のタイムスタンプを持つメインスレッドのメッセージがより早いタイムスタンプを持つ他のスレッドのメッセージの前に表示されることがあります。

source: However initializing the string using wxString::FromUTF8() method and then accessing it as a char string via its wxString::c_str() method is a recipe for disaster as the program may work perfectly well during testing on Unix systems using UTF-8 locale but completely fail under Windows where UTF-8 locales are never used because wxString::c_str() would return an empty string.
ja: しかし、wxString::FromUTF8() 関数で初期化した文字列に対して、wxString::c_str() 関数を使って char 文字列のようにアクセスしようとするのは災いのもとです。そのプログラムは UTF-8 ロケールを使用している Unix システムでテストしている間は完璧に動作するでしょうが、UTF-8 ロケールを使用していない Windows では wxString::c_str() が空文字列を返すかもしれないため、全く動作しなくなるでしょう。

source: However there is no built in method to send messages to the worker threads and you will need to use the available synchronization classes to implement the solution which suits your needs yourself.
ja: しかし、ワーカースレッドへメッセージを送信するためのビルトイン関数は存在しないため、要件にあった解決方法を実装するために既存の同期オブジェクトを使用する必要があります。

source: However writing
ja: しかし、次のように書くと

source: However you should be aware of the potential problems covered by the following section.
ja: しかし、次の章で触れる、潜在的な問題については注意すべきです。

source: However, wxSizer also offers a separate method which can tell the sizer not to consider that control in its size calculations.
ja: しかし、wxSizer はそのコントロールのサイズを考慮しないようにする別の関数も提供しています。

source: However, as wxWidgets uses wxLogError() in this situation, the exact error code (and the corresponding error message) will be given to the user together with "high level" message about data file writing error.
ja: しかし、このような状況で wxLogError() を使用すれば、書き込みに失敗したファイルに関する "高レベル" なメッセージとともに正確なエラーコード (と対応するエラーメッセージ) が表示されます。

source: However, the original sizer hierarchy will still hold until Show or ShowModal is called.
ja: ただし、Show または ShowModal が呼ばれるまではサイザーの元の階層構造が保持されています。

source: However, there are several problems as well.
ja: しかし、同様にいくつかの問題も存在します。

source: However, unlike the Unicode build mode of the previous versions of wxWidgets, this support is mostly transparent: you can still continue to work with the narrow (i.e. current locale-encoded char*) strings even if wide (i.e. UTF16-encoded wchar_t* or UTF8-encoded char*) strings are also supported.
ja: しかし、wxWidgets の以前のバージョンにおける Unicode ビルドモードとは異なり、この対応はほとんど透過的です： ワイド 文字列 (UTF16 で符号化された wchar_t* か、UTF8 で符号化された char* のことです) がサポートされていても、引き続き ナロー 文字列 (現在のロケールで符号化された char* のことです) を使用することができます。

source: However, using wxString::Alloc() is tedious and so wxString tries to do its best.
ja: しかし、wxString::Alloc() を使用するのは手間がかかるため、wxString ではできるだけのことをしています。

source: However, using Alloc() is tedious and so wxString tries to do its best.
ja: しかし、Alloc() を使用するのは手間がかかるため、wxString ではできるだけのことをしています。

source: If wxDialog::GetContentWindow returns a window derived from wxBookCtrlBase, the pages are made scrollable and no other adaptation is done.
ja: wxDialog::GetContentWindow が wxBookCtrlBase を継承したウィンドウを返却する場合、ページがスクロール可能になるだけで、それ以外の適応は行われません。

source: If UTF-8 is used for the internal storage in wxString, wxUSE_UNICODE_UTF8 is also defined, otherwise wxUSE_UNICODE_WCHAR is.
ja: wxString の内部領域に UTF-8 を使用する場合、あわせて wxUSE_UNICODE_UTF8 が定義されます。そうでない場合は wxUSE_UNICODE_WCHAR が定義されます。

source: If a conversion had taken place in cWX2MB (i.e. in a Unicode build), the buffer will be deallocated as soon as tmp_buf goes out of scope.
ja: cWX2MB で変換が行われる場合 (つまり、Unicode ビルドの場合)、tmp_buf がスコープから外れると直ちにバッファが解放されます。

source: If a widget doesn't have a border then its client size is the same as its size.
ja: ウィジェットがボーダーを持たない場合、クライアントサイズはウィジェットのサイズと同じ大きさになります。

source: If a window doesn't have any border (and is not a wxFrame with some bars) then its client size is the same as its size.
ja: ウィンドウがボーダーを持たない場合 (そしてステータスバーなどを含む wxFrame でない場合)、クライアントサイズはウィンドウのサイズと同じ大きさになります。

source: If all goes well, then OnData will get called and the wxDataObject belonging to the drop target can get filled with data.
ja: すべてがうまく行くと OnData が呼び出され、ドロップ先に所属する wxDataObject にデータが引き渡されます。

source: If all goes well, then wxDropTarget::OnData will get called and the wxDataObject belonging to the drop target can get filled with data.
ja: すべてがうまく行くと wxDropTarget::OnData が呼び出され、ドロップ先に所属する wxDataObject にデータが引き渡されます。

source: If allowed, both the server and client objects create wxConnection objects which persist until the connection is closed.
ja: 接続が許可されるとサーバとクライアントの双方で wxConnection が作成され、接続が閉じられるまで維持されます。

source: If instead you choose to use threads in your application, please read also the following sections of this overview.
ja: 代わりにスレッドを使用すると決めた場合、この概要の以降の章も参照してください。

source: If it has no children then nothing is done, if it does have children then the size of the window is set to the window's best size.
ja: 子コントロールを持たない場合は何も行いませんが、子コントロールを持つ場合はそのウィンドウの最適サイズにあわせてウィンドウサイズを設定します。

source: If it returns anything but -1 (default), the event handling stops immediately.
ja: -1 (デフォルト) 以外の値を返却した場合、ただちにイベント処理を終了します。

source: If no standard buttons were found, the whole dialog content will scroll.
ja: 標準ボタンが見つからなかった場合、ダイアログ全体がスクロールされます。

source: If several windows have a value above zero, the value is interpreted relative to the sum of all weight factors of the sizer, so when adding two windows with a value of 1, they will both get resized equally much and each half as much as the sizer owning them.
ja: いくつかのウィンドウが 0 より大きい値を持つ場合、その値はサイザーのすべての重み係数の和に対する相対値として解釈されます。そのため、値が 1 であるウィンドウをふたつ追加する場合、両方とも同じようにリサイズされ、それぞれサイザーの半分の大きさになります。

source: If such a variable address is not supplied by the user, then the validator should store the data internally.
ja: そのような変数のアドレスが指定されなかった場合、バリデータは内部にデータを格納するべきです。

source: If supported by the platform this class will provide the platform's native progress dialog...
ja: プラットフォームがこのクラスに対応している場合、プラットフォームのネイティブのプログレスダイアログを提供します。それ以外の場合、単純に wxGenericProgressDialog になります。

source: If that search failed too, wxWidgets finds 'loose' standard buttons (in any kind of sizer) and adds them to a wxStdDialogButtonSizer.
ja: これも見つからなかった場合、wxWidgets は (任意の種類のサイザーに含まれる) 'ゆるい' 標準ボタンを探し、 wxStdDialogButtonSizer に追加します。

source: If that search failed, wxWidgets looks for a horizontal wxBoxSizer with one or more standard buttons, with identifiers such as wxID_OK and wxID_CANCEL.
ja: もしも見つからなかった場合、wxID_OK や wxID_CANCEL などの識別子を持つ、ひとつ以上の標準ボタンを含む水平方向の wxBoxSizer を探します。

source: If the application is for some reason forcing the application to close (wxCloseEvent::CanVeto returns false), the window should always be destroyed, otherwise there is the option to ignore the request, or maybe wait until the user has answered a question before deciding whether it is safe to close.
ja: なんらかの理由で強制的にアプリケーションを終了させる場合 (wxCloseEvent::CanVeto が false を返却する場合)、常にウィンドウを破棄するべきです。それ以外の場合では終了要求を無視するか、安全に終了できるか決定する前にユーザへ確認するという選択肢があります。

source: If the character is inappropriate, it is vetoed (does not appear) and a warning beep sounds (unless wxValidator::SetBellOnError(false) has been called).
ja: 入力された文字が不適切だった場合、入力は拒否され (画面上に現れません)、警告ビープ音が鳴ります。(ただし、 wxValidator::SetBellOnError(false) が呼ばれていない場合に限ります)

source: If the character is inappropriate, it is vetoed (does not appear) and a warning beep sounds.
ja: 入力された文字が不適切だった場合、入力は拒否され (画面上に現れません)、警告ビープ音が鳴ります。

source: If the client wants to find the result of the Execute command other than success or failure, it has to explicitly call Request.
ja: 呼び出しの成否以外に Execute コマンドの結果を得たい場合、明示的に Request を呼ぶ必要があります。

source: If the dialog box is modal, the calling program is blocked until the dialog box is dismissed.
ja: ダイアログボックスが モーダル の場合、ダイアログボックスが閉じられるまでプログラムがブロックする。

source: If the environment in which your program is running is under your control -- as is quite often the case in such scenarios -- consider ensuring that the system always uses UTF-8 locale and use --enable-utf8only configure option to disable support for the other locales and consider all strings to be in UTF-8.
ja: (そのような状況では、よくこの場合に当てはまりますが) もしプログラムの実行される環境を制御できるのであれば、システムが常に UTF-8 ロケールを使用するようにし、--enable-utf8only オプションを使用して他のロケールのサポートを無効にすることを考慮してみてください。

source: If the message catalogs are not installed in this default location you may explicitly use AddCatalogLookupPathPrefix() to still allow wxWidgets to find them but it is strongly recommended to use the default directory.
ja: このデフォルトの場所にメッセージカタログをインストールしない場合、明示的に AddCatalogLookupPathPrefix() を使用することで wxWidgets がその場所を探すようになります。ただし、デフォルトのディレクトリを使用することを強く推奨します。

source: If the message catalogs are not installed in this default location you may explicitly use wxLocale::AddCatalogLookupPathPrefix() to still allow wxWidgets to find them but it is strongly recommended to use the default directory.
ja: このデフォルトの場所にメッセージカタログをインストールしない場合、明示的に AddCatalogLookupPathPrefix() を使用することで wxWidgets がその場所を探すようになりますが、デフォルトのディレクトリを使用することを強く推奨します。

source: If the min size is (50, 20) then the best fitting size is (50, 20).
ja: 最小サイズが (50, 20) の場合は (50, 20) が最適フィットサイズになります。

source: If the object is a wxWindow and has an associated validator, wxValidator gets a chance to process the event.
ja: オブジェクトが wxWindow で、かつ、関連するバリデータを持っている場合、wxValidator でイベントを処理します。

source: If the object is a wxWindow and the event is set to propagate (by default only wxCommandEvent-derived events are set to propagate), then the processing restarts from the step (1) (and excluding the step (7)) for the parent window.
ja: オブジェクトが wxWindow で、かつ、イベントが伝播するように設定されている (デフォルトでは wxCommandEvent を継承したイベントのみ、伝播するよう設定されています) 場合、親ウィンドウに対してステップ (1) から (ステップ (7) を除いて) 再度処理を行います。

source: If the object is a wxWindow and the event is set to set to propagate (in the library only wxCommandEvent based events are set to propagate), ProcessEvent is recursively applied to the parent window's event handler.
ja: オブジェクトが wxWindow で、かつ、イベントが伝播するように設定されている (ライブラリの中では wxCommandEvent の派生イベントのみ、伝播するよう設定されています) 場合、親ウィンドウの ProcessEvent が再帰的に呼ばれます。

source: If the object is a wxWindow, ProcessEvent is recursively called on the window's wxValidator.
ja: オブジェクトが wxWindow の場合、ProcessEvent はウィンドウの wxValidator から再帰的に呼び出されます。

source: If the object is disabled (via a call to wxEvtHandler::SetEvtHandlerEnabled) the function skips to step (6).
ja: (wxEvtHandler::SetEvtHandlerEnabled を呼ぶことで) オブジェクトが無効化されている場合、(6) までスキップします。

source: If the server agrees, the server will send an OnAdvise message to the client along with the item and data.
ja: サーバがこれを承諾した場合、サーバは項目とデータとともに OnAdvise メッセージをクライアントへ送信します。

source: If the server is unwilling to reply, the return value is NULL.
ja: サーバが応答しない場合、戻り値は NULL になります。

source: If the size passed to the constructor is the default wxDefaultSize, or if the size is not fully specified (such as wxSize(150,-1)) then most controls will fill in the missing size components using the best size and will set the initial size of the control to the resulting size.
ja: コンストラクタで指定された値がデフォルトの wxDefaultSize の場合、もしくは (wxSize(150,-1) といったように) 完全に指定されていない場合、ほとんどのコントロールでは足りない部分を最適サイズを使用して補完し、その結果を初期サイズとして設定します。

source: If the sizer is the one that is assigned to the window then this should be equivalent to wxWindow::Fit().
ja: ウィンドウに割り当てられているサイザーがひとつだけの場合は wxWindow::Fit() と等価になります。

source: If the window has a sizer then it is used to calculate the best size.
ja: ウィンドウでサイザーが使用されていれば、それが最適サイズの計算に使用されます。

source: If the window has layout constraints instead of a sizer then the constraints algorithm is run.
ja: ウィンドウがサイザーの代わりにレイアウト制約を使用している場合は制約アルゴリズムが実行されます。

source: If this behaviour is not desirable wxApp::SetExitOnFrameDelete can be called to change it.
ja: この振る舞いが望ましくない場合、wxApp::SetExitOnFrameDelete を呼ぶことで振る舞いを変更することができます。

source: If this event handler is disabled via a call to wxEvtHandler::SetEvtHandlerEnabled() the next three steps are skipped and the event handler resumes at step (5).
ja: イベントハンドラが wxEvtHandler::SetEvtHandlerEnabled() によって無効化されている場合、次の 3 ステップはスキップし、(5) から処理を継続します。

source: If this fails, the base class table is tried, and so on until no more tables exist or an appropriate function was found, in which case the function exits.
ja: ProcessEvent が true を返さなかった場合、基底クラスのイベントテーブルを検索します。これを順次、イベントテーブルが存在しなくなるか、適切な関数が見つかるまで行います。適切な関数が見つからなかった場合、処理を終了します。

source: If this object is not a window but the next handler exists, the event is passed to its parent if it is a window.
ja: このオブジェクトがウィンドウでないが次のイベントハンドラが存在する場合、親コントロールがウィンドウであれば親コントロールにイベントを引き渡します。

source: If this problem can be solved globally, you can derive a new adapter class from wxStandardDialogLayoutAdapter and override its CreateScrolledWindow function to return an instance of your own class.
ja: アプリケーション全体でグローバルにこの問題を解決できるようであれば wxStandardDialogLayoutAdapter を継承した新しいアダプタクラスを作成し、作成したクラスのインスタンスを返却するように CreateScrolledWindow 関数をオーバーライドしてください。

source: If this returns true, the function exits.
ja: ProcessEvent が true を返した場合、処理を終了します。

source: If this succeeds, the function exits.
ja: 検索に成功した場合、処理を終了します。

source: If using Close(), you can pass a true argument to this function to tell the event handler that we definitely want to delete the frame and it cannot be vetoed.
ja: Close() を使用している場合は引数に true を渡すことで、このフレームを確実に破棄したいと考えており、終了要求を拒否できないことをイベントハンドラへ通知できます。

source: If you are using a window or panel instead of a dialog, you will need to call wxWindow::InitDialog explicitly before showing the window.
ja: もしダイアログの代わりにウィンドウやパネルを使用している場合、ウィンドウを表示する前に明示的に wxWindow::InitDialog を呼ぶ必要があります。

source: If you believe that it would be advantageous to use UTF-8 for the strings in your particular application, you may rebuild wxWidgets to use UTF-8 as explained above (notice that this is currently not supported under Microsoft Windows and arguably doesn't make much sense there as Windows itself uses UTF-16 and not UTF-8) but be sure to be aware of the performance implications (see Performance Implications of Using UTF-8) of using UTF-8 in wxString before doing this!
ja: もしあなたのアプリケーションで UTF-8 が好都合だと思うのなら、上で説明したように UTF-8 を使用するように wxWidgets をビルドし直してください。 (今のところ、Microsoft Windows ではこれに対応しておらず、Windows 自身は UTF-8 ではなく UTF-16 を使用しているため、明らかにあまり意味がないことに注意してください) ただし、これを行う前に wxString で UTF-8 を使用することによる性能への影響 (UTF-8 を使用することによる性能への影響 参照) を必ず意識するようにしてください!

source: If you compile your program in ANSI mode you can still define wxUSE_WCHAR_T to get some limited support for wchar_t type.
ja: プログラムを ANSI モードでコンパイルした場合でも、 wxUSE_WCHAR_T を定義することで wchar_t の限定的な機能を利用することができます。

source: If you do decide to use threads in your application, it is strongly recommended that no more than one thread calls GUI functions.
ja: アプリケーションでスレッドを使用すると決めた場合、複数のスレッドで GUI 関数を呼び出さないことを強く推奨します。

source: If you do it, you will probably find it helpful to also define WXSTRING_STATISTICS symbol which tells the wxString class to collect performance statistics and to show them on stderr on program termination.
ja: これを行なう場合、WXSTRING_STATISTICS シンボルも定義すると便利なことにおそらく気がつくでしょう。これを定義すると wxString クラスで性能統計を収集し、プログラムの終了時に標準エラー出力へ出力させることができます。

source: If you do read it, please also read the preceding section about reference counting.
ja: もしこの章を読む場合、参照カウンタ の章にも目を通すようにしてください。

source: If you do want to handle messages of different levels differently, then you should override wxLog::DoLogTextAtLevel().
ja: 異なるレベルのメッセージを別々に処理したい場合、wxLog::DoLogTextAtLevel() をオーバーライドしてください。

source: If you ever have to call a window's event handler manually, use the GetEventHandler function to retrieve the window's event handler and use that to call the member function.
ja: もし手動でウィンドウのイベントハンドラを呼ぶ必要がある場合、GetEventHandler 関数でウィンドウのイベントハンドラを取得し、そのメンバ関数を呼び出してください。

source: If you have compiled wxWidgets in Unicode mode, the wxChar type will become identical to wchar_t rather than char, and a wxString stores wxChars.
ja: wxWidgets を Unicode モードでコンパイルしている場合、wxChar 型は char ではなく wchar_t と等価になります。そして、wxString は wxChar を格納します。

source: If you have specialized needs, or just don't want to use wxString, you can also use the conversion methods of the conversion objects directly.
ja: 特別な要件がある場合、もしくは単に wxString を使用したくない場合は変換オブジェクトの変換関数を直接使用することも可能です。

source: If you just want to use a wxCommandEvent with a new event type, use one of the generic event table macros listed below, without having to define a new event class yourself.
ja: 新しいイベント型で wxCommandEvent を使用したいだけの場合、新しいイベントクラスを自分自身で定義する必要はなく、以下の汎用イベントテーブルマクロのひとつを使用してください。

source: If you just want to use a wxCommandEvent with a new event type, you can then use one of the generic event table macros listed below, without having to define a new macro yourself.
ja: 新しいイベント型で wxCommandEvent を使用したいだけの場合、自分自身で新しいマクロを定義するのではなく、以下の汎用的なイベントテーブルマクロを使用することができます。

source: If you load your dialog from a resource file, you will need to iterate through the controls setting validators, since validators can't be specified in a dialog resource.
ja: ダイアログをリソースファイルから読み込む場合、コントロールに対してバリデータを設定する必要があります。これはダイアログリソース内でバリデータを指定できないためです。

source: If you need to do more complex processing on the converted data, you may want to store the temporary buffer in a local variable:
ja: 変換後のデータに対してより複雑な処理を行なう必要がある場合、一時バッファをローカル変数に格納したいと思うかもしれません。

source: If you need to specify a different behaviour for some reason, you can use SetExtraStyle(wxWS_EX_BLOCK_EVENTS) explicitly to prevent the events from being propagated beyond the given window or unset this flag for the dialogs which have it on by default.
ja: なんらかの理由で別の振る舞いをさせる必要がある場合、明示的に SetExtraStyle(wxWS_EX_BLOCK_EVENTS) を使用することでイベントが指定されたウィンドウ外へ伝播するのを止めたり、ダイアログ (デフォルトでこのフラグが設定されています) のフラグを解除したりできます。

source: If you need to specify a different behaviour for some reason, you can use wxWindow::SetExtraStyle(wxWS_EX_BLOCK_EVENTS) explicitly to prevent the events from being propagated beyond the given window or unset this flag for the dialogs that have it on by default.
ja: なんらかの理由で別の振る舞いをさせる必要がある場合、明示的に SetExtraStyle(wxWS_EX_BLOCK_EVENTS) を使用することでイベントが指定されたウィンドウ外へ伝播するのを止めたり、ダイアログ (デフォルトでこのフラグが設定されています) のフラグを解除したりできます。

source: If you nonetheless need to have a wxString that uses wchar_t on Unix and Linux, too, you can specify this on the command line with the configure --disable-utf8 switch or you can consider using wxUString or std::wstring instead.
ja: Unix や Linux でも wchar_t を使用する wxString が必要な場合、コマンドラインで configure --disable-utf8 スイッチを指定するか、代わりに wxUString もしくは std::wstring を使用することができます。

source: If you pass wxID_ANY to a window constructor, an identifier will be generated for you automatically by wxWidgets.
ja: ウィンドウのコンストラクタに wxID_ANY を渡した場合、wxWidgets が自動的に識別子を生成します。

source: If you port software to wxWidgets, you may be confronted with legacy source code containing non-English string literals.
ja: ソフトウェアを wxWidgets に移植する場合、非英語リテラル文字列を含むレガシーなソースコードに直面するかもしれません。

source: If you port software to wxWindows, you may be confronted with legacy source code containing non-English string literals.
ja: ソフトウェアを wxWindows に移植する場合、非英語リテラル文字列を含むレガシーなソースコードに直面するかもしれません。

source: If you translate the accelerator modifier names (Ctrl, Alt and Shift) in your menu labels, you may find the accelerators no longer work.
ja: もしメニューラベル内のアクセラレータの修飾子名 ( Ctrl、Alt、Shift) を翻訳した場合、アクセラレータが動作しなくなることに気がつくでしょう。

source: If you use wxScrolled<T>::SetTargetWindow() you must override wxScrolled<T>::GetSizeAvailableForScrollTarget() method to compute the size available for the scroll target as function of the main window size, please see the documentation of this method for more details.
ja: wxScrolled<T>::SetTargetWindow() を使用している場合、スクロール対象が使用できるサイズをメインウィンドウのサイズから計算するために wxScrolled<T>::GetSizeAvailableForScrollTarget() 関数をオーバーライドする必要があります。詳細はこの関数のドキュメントを参照してください。

source: If you use wxNewId() consistently in your application, you can be sure that your identifiers don't conflict accidentally.
ja: もしアプリケーション内で一貫して wxNewId() を使用するようにすれば、偶発的な識別子の衝突を避けることが可能です。

source: If you use the program xgettext to extract the strings from the source code, specify the option --from-code=<source code charset>.
ja: ソースコードから文字列を抽出するのに xgettext を使用する場合、--from-code=<ソースコードの文字コード> オプションを指定してください。

source: If you used Unicode build of wxWidgets 2.8 or previous version, please read Unicode Support in wxWidgets for the details about how the API changed in 3.0 as a lot of the information which was correct before doesn't apply any longer.
ja: wxWidgets 2.8 やそれ以前のバージョンで Unicode ビルドを使用していた場合、3.0 における API の変更点の詳細について wxWidgets における Unicode 対応 を参照してください。これまで正しかった多くの情報が 3.0 ではもはや当てはまりません。
